package ru.javarush.syntax.level7;

/*
Упорядоченная информация
Перед тобой — плохой пример использования методов:
Методы разделили двустишие;
Одну строку кода не стоит оборачивать в отдельный метод.
Перепиши код так, чтобы весь текст выводился в методе main, а остальные методы удали.
Вывод программы не должен измениться.
*/

public class Task0602 {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Я — поэт, зовусь я Цветик.\nОт меня вам всем приветик.");
    }
}
